
## Plan Result (demo)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_PORT
* Update
  * azurerm_resource_group.rg
* Delete
  * module.db-profile-sync-data-v11.azurerm_resource_group.data-resourcegroup


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-demo/providers/Microsoft.KeyVault/vaults/rd-demo"
      + name                    = "profile-sync-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-profile-sync-demo"
        name     = "rd-profile-sync-demo"
      ~ tags     = {
          - "Deployment Environment" = "demo"
          - "Team Name"              = "RD"
          - "lastUpdated"            = "2024-05-14T15:37:50Z"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.db-profile-sync-data-v11.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-profile-sync-postgres-db-v11-data-demo" -> null
      - location = "uksouth" -> null
      - name     = "rd-profile-sync-postgres-db-v11-data-demo" -> null
      - tags     = {
          - "application"         = "reference-data"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/rd-profile-sync.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "demo"
          - "managedBy"           = "Reference Data"
        } -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":850,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->